app/controllers/songs_controller.rb

SELECT `songs`.* FROM `songs`
---
  def index
    @songs = Song.all

SELECT `songs`.* FROM `songs`  WHERE (`songs`.`id` IS NOT NULL)
---
    def set_song
      @song = Song.find(params[:id])