app/controllers/song_controller.rb

SELECT `songs`.* FROM `songs`  WHERE `songs`.`active` = 1  ORDER BY rank ASC
SELECT `songs`.* FROM `songs`  WHERE (`songs`.`id` IS NOT NULL) AND (`songs`.`filename` IS NOT NULL)
SELECT `songs`.* FROM `songs`  WHERE ((`songs`.`id` IN (779, 747, 806, 802) OR `songs`.`id` IS NULL))
---
  def index
    #redirect_to home_path and return unless browser.chrome?
    #@songs = Song.where.not(id: session[:song_filter], filename: nil)
    @songs = Song.where(active: true).order('rank ASC')
    @song = Song.where.not(filename: nil).order("RAND()").limit(1).first
    @playlist = session[:playlist].nil? ? [] : Song.where(id: session[:playlist])

SELECT `songs`.* FROM `songs`  WHERE `songs`.`active` = 1  ORDER BY rank ASC
---
  def mobile
    @songs = Song.where(active: true).order('rank ASC')

SELECT `songs`.* FROM `songs`  WHERE ((`songs`.`id` IN (779, 747, 806, 802, 803, 838, 798, 813, 796, 798, 801, 805, 806, 806) OR `songs`.`id` IS NULL))
---
  def add_to_session_playlist
    session[:playlist] = [] if session[:playlist].nil?
    session[:playlist] << params[:song_id]

    @songs = Song.where(id: session[:playlist]) rescue []

SELECT `songs`.* FROM `songs`  WHERE ((`songs`.`id` IN (779, 747, 806, 802, 803, 838) OR `songs`.`id` IS NULL))
---
  def send_zip
    #to optimize this we can create a rabbitmq and a running process that runs the following as a rake job
    require 'rubygems'
    require 'zip'

    music_path = Rails.configuration.settings['music_path']

    zip_file = params[:name] + '.zip'
    zip_file_path = Rails.configuration.settings['zip_path'] + zip_file

    songs = Song.where(id: session[:playlist]) rescue []

SELECT  `songs`.* FROM `songs`  WHERE `songs`.`id` = 795  ORDER BY `songs`.`id` ASC LIMIT 1
---
  def send_song
    music_path = Rails.configuration.settings['music_path'] + '/'
    song = Song.where(id: params[:id]).first

SELECT  `songs`.* FROM `songs`  WHERE `songs`.`id` = 1 LIMIT 1
---
  def show
    headers['Access-Control-Allow-Origin'] = "*"
    @song = Song.find(params[:id])